tutorials/compressible/rhoPorousSimpleFoam/beaverJoseph/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 -0.1)
    (8 0 -0.1)
    (8 1 -0.1)
    (0 1 -0.1)
    (0 0 0.1)
    (8 0 0.1)
    (8 1 0.1)
    (0 1 0.1)
    (0 2 -0.1)
    (8 2 -0.1)
    (0 2 0.1)
    (8 2 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) poro (100 20 1) simpleGrading (1 1 1)
    hex (3 2 9 8 7 6 11 10) air (100 20 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (0 4 7 3)
        (3 7 10 8)
    )
    patch outlet
    (
        (2 6 5 1)
        (6 2 9 11)
    )
    wall upperWall
    (
        (8 9 11 10)
    )
    wall lowerWall
    (
        (1 5 4 0)
    )
    empty frontAndBack
    (
        (2 3 8 9)
        (6 7 10 11)
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
